WWCP_eMIP_Adapter/Tests/SetSessionActionRequestRequest001.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <aut:eMIP_FromIOP_SetSessionActionRequestRequest xmlns:aut="https://api-iop.gireve.com/schemas/AuthorisationV1/">
	  <transactionId>IOP-TID-GIR-V-IOPPPFT02-c48288c0-a7b8-4bae-82aa-df41fdac84bc</transactionId>
	  <partnerIdType>eMI3</partnerIdType>
	  <partnerId>FR*107</partnerId>
	  <operatorIdType>eMI3</operatorIdType>
	  <operatorId>FR*MSP</operatorId>
	  <targetOperatorIdType>eMI3</targetOperatorIdType>
	  <targetOperatorId>DE*BDO</targetOperatorId>
	  <serviceSessionId>7e4bede2-da7d-4747-a84d-027aca1d458c</serviceSessionId>
	  <sessionAction>
        <sessionActionNature>0</sessionActionNature>
        <sessionActionId>IOP-SAS-GIR-V-IOPPPFT02-349baea3-c8ce-4f22-9266-5d17fe8b045b</sessionActionId>
        <sessionActionDateTime>2017-02-27T16:48:59.000+01:00</sessionActionDateTime>
      </sessionAction>
    </aut:eMIP_FromIOP_SetSessionActionRequestRequest>
  </soapenv:Body>
</soapenv:Envelope>
